In [1]:
import pandas as pd

In [5]:
# 2 main datatypes
Series = pd.Series(["bmw","Toyata","Honda"])

In [7]:
Series

0       bmw
1    Toyata
2     Honda
dtype: object

In [8]:
# Series= 1-dimentional

In [9]:
colors=pd.Series(["red","blue","green"])

In [10]:
colors

0      red
1     blue
2    green
dtype: object

In [11]:
 # dataframe= 2-dimentional

In [12]:
car_data=pd.DataFrame({"car make":Series,"color":colors})

In [13]:
car_data

  car make  color
0      bmw    red
1   Toyata   blue
2    Honda  green

In [14]:
# Import data

In [15]:
car_scales =pd.read_csv("car-sales.csv")

In [16]:
 car_scales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [17]:
# exporting a data frame

In [23]:
car_scales.to_csv("Exported-car-sales.csv",index=False)

In [24]:
export_car_scales=pd.read_csv("Exported-car-sales.csv",)

In [25]:
export_car_scales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00